/**
 * バブルソート
 * 入力された数字10個を昇順に並べ替えるプログラムを作成してください。
 *
 * ソートアルゴリズムには様々な種類がありますが、今回はバブルソートを使用します。
 *
 * まず、並べ替える数字の入っている箱が横一列に並んでいるとイメージします。
 * 1個目の箱と2個目の箱を比較し、2個目のほうが小さいなら数字を交換します。
 * 次は1個目の箱と3個目の箱を比較し、3個目のほうが小さいなら数字を交換します。
 * この比較を順番にすべての箱（数字）で行っていきます。
 * 1個目の箱が終わったら次は2個目の箱を基準に3個目以降の箱を比較していきます。
 * 最終的に左から順に小さい数字になるように並べ替えます。
 * このように、小さい数値(または大きい数値)が順々に沸き登っていくようなソートアルゴリズムを、バブルソート呼びます。
 *
 * 実行例：
 *
 * ソート前：
 * 15 63 50 1 4 68 100 3 42 7
 * ソート後：
 * 1 3 4 7 15 42 50 63 68 100
 *
 */
package section04_summary.challenge05;

public class BubbleSort {

	public static void main(String[] args) {

	}

}
