/**
 * 一年の経過と残り
 * 入力した日付から、一年の経過日数と残り日数を計算して出力してください。
 * 2月は28日とします。
 * 
 * 不正な月や日を入力された場合はプログラムを終了してください。
 * 下記ステートメントを実行するとプログラムが終了します。
 * System.exit(0);
 * 
 * 実行例：
 * （正しい日付を入力）
 * 今は何月ですか＞5
 * 今日は何日ですか＞15
 * 一年の経過日数は135日です。
 * 一年の残り日数は230日です。
 * 
 * （不正な月を入力）
 * 今は何月ですか＞13
 * 1～12を入力してください
 * 
 * （不正な日付を入力）
 * 今は何月ですか＞2
 * 今日は何日ですか＞29
 * 正しい日付を入力してください
 * 
 * ヒント：
 * ・if文とswitch文を組み合わせて実装することを想定しています。
 * ・月や日は決まっている数字なので「定数」です。
 * ・処理をいくつかのセクションに区切って考えるとよいでしょう。
 * 　以下のようなセクション分けが考えられます。
 * 　・月の入力と、入力値の確認
 * 　・日の入力と、入力値の確認
 * 　・経過日数の計算
 * 　・残日数の計算
 * 　・結果の出力
 * 
 */

package section02_conditional_branch.challenge03;

public class ElapsedAndRemainingDays {

	public static void main(String[] args) {
		
	}

}