/**
 * 3科目の成績(if)
 * 
 * 整数を3個入力させ、その平均点から成績を4段階で判定するプログラムを作成してください。
 * 条件：
 * 　if文で作成してください
 * 　入力するのは整数3個
 * 　入力値は100以下でなければいけない
 * 　入力値に101以上の数字があった場合はプログラムを終了する
 * 　平均点は浮動小数で表示すること
 * 成績の判定：
 * 　平均点に応じて成績を表示する
 * 　100点なら「満点です！」
 * 　80以上100未満なら「大変良くできました。」
 * 　60以上80未満なら「よくできました。」
 * 　60未満なら「もっと頑張りましょう」
 * 
 * 補足：
 * 　プログラムを途中で終了したい場合は下記ステートメントを使います。
 * 　なお、使わなくても実装は可能です。
 * 　System.exit(0);
 * 
 * 実行例：
 * （100点満点の場合）
 * 3科目の点数を入力してください:
 * 国語＞100
 * 数学＞100
 * 英語＞100
 * 平均点は100.0点です。
 * 満点です！
 * 
 * （100より大きい数字があった場合）
 * 3科目の点数を入力してください:
 * 国語＞101
 * 数学＞88
 * 英語＞56
 * 100以下の数字を入力してください。
 * 
 */

package section02_conditional_branch.challenge01;

public class Grading {

	public static void main(String[] args) {
		
	}

}
