/**
 * クラスの成績 (多次元配列）
 *
 * 実行例を参考に、クラス毎の成績を計算して一覧を出力してください
 * クラス数は2、1クラスあたりの生徒数は3人の2次元配列で定義してください。
 * クラスの各生徒に、整数の点数を入力し、クラスごとの成績を出力します。
 * 成績は、クラスごとの合計点と平均点(少数まで)を出力します。
 *
 * (実行例)
 * 1組、出席番号1番の点数＞5
 * 1組、出席番号2番の点数＞7
 * 1組、出席番号3番の点数＞9
 * 2組、出席番号1番の点数＞11
 * 2組、出席番号1番の点数＞13
 * 2組、出席番号1番の点数＞17
 * 1組の合計点は21点、平均点は7.0点です。
 * 2組の合計点は41点、平均点は13.666666666666666点です。
 *
 */

package section01_array.challenge03;

import java.util.Scanner;

public class GradeList_Array {

	public static void main(String[] args) {
		// 標準入力の準備
		Scanner stdIn = new Scanner(System.in);



		// 標準入力の終了
		stdIn.close();
	}

}
