package review;

/**
 *  Java1日目復習クラス
 *  ・ 標準出力
 *  ・ リテラル
 *  ・ 変数
 */
public class Day1 {
	public static void main(String[] args) {
		/*
		 * Day1復習問題です。
		 * [目的]
		 * ・標準出力の使い方の復習。
		 * ・リテラルの種類とそれぞれの使い方の復習と応用。
		 * ・変数の宣言方法と基本型の値の代入。
		 * 
		 * [ストーリー]
		 * 149800円のiPhone14Proを1000台購入しようと思っています。
		 * 予算は、25億円です。
		 * 学んだ知識をベースに、予算残高を計算してみましょう。
		 * 
		 * [問題の解き方]
		 * 問題の記載された箇所の下に、コードを書いていきましょう。
		 * 例）↓ */
		 // 1)コンソールにDAY1復習問題と出力しよう。	
		 System.out.println("DAY1復習問題");
		
		// 1)コンソール上に以下の文言を出力しよう
		// 標準出力、リテラル、変数の復習と応用
		// ================================

		// 2)商品名を意味する文字列型の変数「itemName」を宣言しよう。

		// 3)itemNameにiPhone 14 Proを代入しよう。

		// 4)単価を意味する整数型の変数「unitPrice」を宣言しよう

		// 5)unitPriceに149800を代入しよう

		// 6)購入数を意味する整数型の変数「purchaseNumber」を宣言し、初期値「1000」を代入しよう

		// 7)ここまでに使用した変数を用いコンソールに以下の内容を出力しよう。
		// iPhone 14 Proを1000台、購入します。
		// 単価は149800円です。

		// 8)合計価格を意味する整数型の変数「totalPrice」を宣言し、
		// 初期値として単価*購入数を代入しよう

		// 9)ここまでに使用した変数を用いコンソールに以下の内容を出力しよう。
		// iPhone 14 Proを1000個、購入した場合の合計価格は以下となります。
		// 合計価格：\149800000
		// ================================

		// 10)予算を意味する整数型の変数budgetを宣言し、初期値2500000000を代入しよう。

		// 【プチ応用問題】
		// 1）ここまでに使用した変数を用いコンソールに以下の内容を出力しよう。
		// 予算は、25億円です。
		// iphone14Proを単価149800円で1000台購入した場合、
		// 予算残高は、2350200000円となります。

		// 【応用問題】
		// 1)割引率を意味する浮動小数点数型の変数discountRateを代入し、初期値0.1を代入しよう
		
		// 2)割引後単価を意味する整数型の変数unitPriceAfterDiscountを宣言しよう。
		
		// 3)unitPriceとdiscountRateを利用し、unitPriceAfterDiscountに割引後の単価を代入せよ。
		
		// 4)ここまでに使用した変数を用いコンソールに以下の内容を出力しよう。
		// 割引後の単価は134820円です。
		

	}
}
